<template>
  <v-row>
      <v-col v-bind:md="child_extend ? 3 : 0" cols="12">
          <tunnel-side-card-details @isExtend='child_extend = $event' selectTab="inspection" />
    </v-col>
    <v-col v-bind:md="child_extend ? 9 : 12" cols="12">
      <v-card elevation="3">
        <div class="d-flex">
          <v-card-title>
            ■点検調書 点検結果総括表（トンネル本体工） 【様式C-1-1】
          </v-card-title>
        </div>
        <v-card-text>
          <v-row no-gutters>
            <v-col md="12" cols="12">
              <v-table density="compact" class="ledger">
                <tbody>
                  <tr>
                    <th>フリガナ</th>
                    <td>ゴンダトンネル</td>
                    <th>路線名</th>
                    <td>主32 八王子五日市線</td>
                    <th>点検業者・点検者名</th>
                    <td>アジア航測（株）青柳健二</td>
                    <th>点検年月日</th>
                    <td>2018年11月9日</td>
                  </tr>
                  <tr>
                    <th>名称</th>
                    <td>権田トンネル</td>
                    <th>管理事務所</th>
                    <td>西多摩建設事務所</td>
                    <th>調査業者・調査技術者名</th>
                    <td>・</td>
                    <th>調査年月日</th>
                    <td></td>
                  </tr>
                </tbody>
              </v-table>
              <v-table density="compact" class="ledger">
                <tbody>
                  <tr>
                    <th rowspan="25" class="text-center vertical" style="width:3em">点検結果</th>
                    <th rowspan="2" class="text-center">覆工<br>スバン<br>番号</th>
                    <th rowspan="2" class="text-center">変状<br>番号</th>
                    <th rowspan="2" class="text-center">距離<br>（ｍ）</th>
                    <th colspan="2" class="text-center">変状部位</th>
                    <th colspan="4" class="text-center">変状の内容</th>
                    <th colspan="2" class="text-center">前回点検時の状態</th>
                    <th colspan="4" class="text-center">点検・調査履歴</th>
                    <th colspan="2" class="text-center">措置履歴</th>
                    <th rowspan="2" class="text-center">対応方針<br>・<br>特記事項</th>
                  </tr>
                  <tr>
                    <th class="text-center">対象箇所</th>
                    <th class="text-center">部位区分</th>
                    <th class="text-center">変状区分</th>
                    <th class="text-center">変状種類</th>
                    <th class="text-center">変状の発生範囲の規模</th>
                    <th class="text-center">前回点検時との比較</th>
                    <th class="text-center">状態</th>
                    <th class="text-center">健全性</th>
                    <th class="text-center">調査<br>の<br>要否</th>
                    <th class="text-center vertical" style="width:3em">実施</th>
                    <th class="text-center">対策区<br>分の<br>判定</th>
                    <th class="text-center">措置の<br>要否</th>
                    <th class="text-center vertical" style="width:3em">実施</th>
                    <th class="text-center">健全性<br>（措置後）</th>
                  </tr>
                  <tr v-for="item in items" :key="item.no">
                    <td>{{ item.c1 }}</td>
                    <td>{{ item.c2 }}</td>
                    <td>{{ item.c3 }}</td>
                    <td>{{ item.c4 }}</td>
                    <td>{{ item.c5 }}</td>
                    <td>{{ item.c6 }}</td>
                    <td>{{ item.c7 }}</td>
                    <td>{{ item.c8 }}</td>
                    <td>{{ item.c9 }}</td>
                    <td>{{ item.c10 }}</td>
                    <td>{{ item.c11 }}</td>
                    <td>{{ item.c12 }}</td>
                    <td>{{ item.c13 }}</td>
                    <td>{{ item.c14 }}</td>
                    <td>{{ item.c15 }}</td>
                    <td>{{ item.c16 }}</td>
                    <td>{{ item.c17 }}</td>
                    <td>{{ item.c18 }}</td>
                  </tr>
                </tbody>
              </v-table>
              <v-row>
                <v-card-text>
                  <v-sheet>※変状の除去が不完全で、緊急対応が必要な場合は対応方針欄に記入すること。</v-sheet>
                  <v-sheet>※1区間の覆工に複数の変状がある場合は、変状箇所毎に記入すること。</v-sheet>
                </v-card-text>
              </v-row>
            </v-col>
          </v-row>
        </v-card-text>
      </v-card>
    </v-col>
  </v-row>
</template>

<script lang="ts">
export default defineComponent({
  data() {
    return {
      child_extend: true,
      items: [
        {
          no: '1', c1: 'PS', c2: '31', c3: '0', c4: '覆工', c5: 'アーチ', c6: '外力', c7: 'ひび割れ', c8: '0.5ｍｍ×25ｍ',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅱa', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '2', c1: 'PS', c2: '37', c3: '0', c4: '覆工', c5: '左アーチ', c6: '外力', c7: 'ひび割れ', c8: '0.5ｍｍ×2ｍ+0.3ｍｍ×1.5ｍ',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅱa', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '3', c1: 'PS', c2: '38', c3: '0', c4: '覆工', c5: '右アーチ', c6: '外力', c7: 'ひび割れ', c8: '0.3ｍｍ×1.0ｍ+0.4ｍｍ×1.5ｍ',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅱa', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '4', c1: 'PS', c2: '3', c3: '2.5', c4: '覆工', c5: '右アーチ', c6: '材料劣化', c7: 'はく離', c8: '0.1ｍｍ×1.5ｍ欠損',
          c9: '0.05ｍ×1.2ｍ', c10: 'はく離', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '叩き落し、経過観察の継続'
        },
        {
          no: '5', c1: '1', c2: '32', c3: '2.5', c4: '覆工', c5: 'アーチ', c6: '外力', c7: 'ひび割れ', c8: '0.6ｍｍ×58ｍ',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '変状33に含む経過観察の継続'
        },
        {
          no: '6', c1: '1', c2: '2', c3: '2.5', c4: '覆工', c5: '左アーチ', c6: '外力', c7: 'ひび割れ', c8: '-',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: 'Ⅱa', c15: '否', c16: '', c17: '', c18: '変状33に含む経過観察の継続'
        },
        {
          no: '7', c1: '1', c2: '4', c3: '3', c4: '覆工', c5: '右アーチ', c6: '外力', c7: 'ひび割れ', c8: '-',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: '-', c15: '否', c16: '', c17: '', c18: '変状33に含む経過観察の継続'
        },
        {
          no: '8', c1: '1', c2: '5', c3: '7', c4: '覆工', c5: '右アーチ', c6: '外力', c7: 'ひび割れ', c8: '-',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: '-', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '9', c1: '1', c2: '39', c3: '5', c4: '覆工', c5: '左側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×4.5ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: '-', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '10', c1: '1', c2: '40', c3: '7', c4: '覆工', c5: '左側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×（4.0+1.1）ｍ',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '11', c1: '1', c2: '41', c3: '7', c4: '覆工', c5: '右側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×6.2ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '12', c1: '1', c2: '42', c3: '8', c4: '覆工', c5: '右側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×2.0ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '13', c1: '2', c2: '33', c3: '9.5', c4: '覆工', c5: 'アーチ', c6: '外力', c7: 'ひび割れ', c8: '0.6ｍｍ×56ｍ',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: 'Ⅱa', c15: '否', c16: '', c17: '', c18: '変状33に含む経過観察の継続'
        },
        {
          no: '14', c1: '2', c2: '7', c3: '10', c4: '覆工', c5: '右アーチ', c6: '外力', c7: 'ひび割れ', c8: '-',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: '-', c15: '否', c16: '', c17: '', c18: '変状33に含む経過観察の継続'
        },
        {
          no: '15', c1: '2', c2: '8', c3: '11', c4: '覆工', c5: '左アーチ', c6: '外力', c7: 'ひび割れ', c8: '-',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: '-', c15: '否', c16: '', c17: '', c18: '変状33に含む経過観察の継続'
        },
        {
          no: '16', c1: '2', c2: '9', c3: '12', c4: '覆工', c5: '右アーチ', c6: '外力', c7: 'ひび割れ', c8: '-',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: '-', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '17', c1: '2', c2: '43', c3: '9.5', c4: '覆工', c5: '右側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×0.6ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '18', c1: '2', c2: '46', c3: '10', c4: '覆工', c5: '右側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×2.5ｍ',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '19', c1: '2', c2: '44', c3: '12', c4: '覆工', c5: '左側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×4.5ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '20', c1: '2', c2: '47', c3: '12', c4: '覆工', c5: '右側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.5ｍｍ×7.3ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '21', c1: '2', c2: '45', c3: '14', c4: '覆工', c5: '左側壁', c6: '材料劣化', c7: 'ひび割れ', c8: '0.3ｍｍ×2.0ｍタイル破損',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '22', c1: '2', c2: '48', c3: '14', c4: '覆工', c5: '右アーチ', c6: '材料劣化', c7: 'ひび割れ', c8: '0.5ｍｍ×1.7ｍ+0.3ｍｍ×1.5ｍ',
          c9: '', c10: '', c11: '', c12: '否', c13: '-', c14: 'Ⅰ', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
        {
          no: '23', c1: '3', c2: '34', c3: '17', c4: '覆工', c5: 'アーチ', c6: '材料劣化', c7: 'ひび割れ', c8: '1.0ｍｍ×64ｍ溶脱物',
          c9: '', c10: 'ひび割れ', c11: '', c12: '否', c13: '-', c14: 'Ⅱa', c15: '否', c16: '', c17: '', c18: '経過観察の継続'
        },
      ],
    }
  },
  mounted: function () {
    console.log("mounted inspectionC11");
  },
  methods: {
  },
});
</script>

<style>
.vertical {
  writing-mode: vertical-rl;
}
</style>